Autodesk.Revit.DB.ViewFamily
An enumerated type that corresponds to the type of a Revit view.
Since:
2013

Autodesk.Revit.DB.ViewFamily.StructuralPlan
Structural plan view.

Autodesk.Revit.DB.ViewFamily.GraphicalColumnSchedule
Graphical column schedule.

Autodesk.Revit.DB.ViewFamily.PanelSchedule
Panel schedule.

Autodesk.Revit.DB.ViewFamily.Legend
Legend view.

Autodesk.Revit.DB.ViewFamily.PressureLossReport
Pressure loss report.

Autodesk.Revit.DB.ViewFamily.LoadsReport
HVAC load report.

Autodesk.Revit.DB.ViewFamily.Elevation
Elevation view.

Autodesk.Revit.DB.ViewFamily.Detail
Detail view.

Autodesk.Revit.DB.ViewFamily.Section
Section view.

Autodesk.Revit.DB.ViewFamily.CeilingPlan
Ceiling plan view.

Autodesk.Revit.DB.ViewFamily.AreaPlan
Area plan view.

Autodesk.Revit.DB.ViewFamily.FloorPlan
Floor plan view.

Autodesk.Revit.DB.ViewFamily.Drafting
Drafting view.

Autodesk.Revit.DB.ViewFamily.Sheet
Sheet view.

Autodesk.Revit.DB.ViewFamily.CostReport
Cost report view (obsolete).

Autodesk.Revit.DB.ViewFamily.Schedule
Schedule view.

Autodesk.Revit.DB.ViewFamily.ImageView
Rendering view.

Autodesk.Revit.DB.ViewFamily.Walkthrough
Walkthrough view.

Autodesk.Revit.DB.ViewFamily.ThreeDimensional
3D view.

Autodesk.Revit.DB.ViewFamily.Invalid
Invalid view type.